[
  {
    "path": "posts/2021-06-02-high-resolution-covariates-and-top-down-population-disagregation/",
    "title": "High-resolution Covariates and Top-down Population Models",
    "description": "To obtain high-resolution population estimates, WorldPop developed a top-down method that disagregates population totals into grid cells thanks to ancillary geospatial covariates [@stevens2015]. We will study the use of very high-resolution covariates in the disagregation process and its impact on the gridded estimates. The study will examine building-footprint derived covariates in Sierra Leone.",
    "author": [
      {
        "name": "Edith Darin",
        "url": {}
      }
    ],
    "date": "2021-06-02",
    "categories": [],
    "contents": "\r\nBackground\r\nTo obtain high-resolution population estimates, WorldPop developed a top-down method that disagregates population totals into grid cells thanks to ancillary geospatial covariates.\r\nThe method consists in fitting a random-forest model (Breiman 2001) at the finest administrative level for which population count is available. The estimated model is then used to predict population density for every grid cell thanks to the geospatial covariates. Finally, the gridded population density layer plays the role of weighting layer to spread the population totals.\r\nWorldPop initative for mapping population globally (WorldPop Research Group et al. 2018) requires a set of covariates related to human distributions that are openly available for the entire world. It is thus based on six data sources where the raster resolution ranges from 900m to 90 m at the Equateur (Lloyd et al. 2019). All the vector-based covariates are processed as distance to nearest feature - this results in a fine spatial distribution but that is not representative of sub-grid cell patterns and have relative accuracy.\r\nRecently, WorldPop released openly gridded building patterns across entire sub-Saharan Africa at 100m resolution (Dooley and Tatem 2020). These were derived from building footprints extracted from satellite imagery with a spatial accuracy of 6m (Ecopia.AI and Maxar Technologies 2019). In top-down modelling, this data has already been used to produce an alternative global set of gridded population estimates constraining the estimates to settled grid cells, that are cells containing at least a building footprint (Bondarenko et al. 2020).\r\nThe purpose of this post will be to study the impact of the building-footprint derived covariates on the modelling and subsequently on the gridded estimates in Sierra Leone.\r\nData\r\nMethod\r\n\r\n\r\n\r\nBondarenko, Maksym, David Kerr, Alessandro Sorichetta, and Andrew Tatem. 2020. “Census/Projection-Disaggregated Gridded Population Datasets for 51 Countries Across Sub-Saharan Africa in 2020 Using Building Footprints.”\r\n\r\n\r\nBreiman, Leo. 2001. “Random Forests.” Machine Learning 45 (1): 5–32.\r\n\r\n\r\nDooley, Claire A, and Andrew J Tatem. 2020. Gridded Maps of Building Patterns Throughout Sub-Saharan Africa, Version 1.0. WorldPop Research Group, University of Southampton. https://doi.org/10.5258/SOTON/WP00666.\r\n\r\n\r\nEcopia.AI, and Maxar Technologies. 2019. Digitize Africa Data.\r\n\r\n\r\nLloyd, Christopher T, Heather Chamberlain, David Kerr, Greg Yetman, Linda Pistolesi, Forrest R Stevens, Andrea E Gaughan, et al. 2019. “Global Spatio-Temporally Harmonised Datasets for Producing High-Resolution Gridded Population Distribution Datasets.” Big Earth Data 3 (2): 108139. https://doi.org/10.1080/20964471.2019.1625151.\r\n\r\n\r\nStevens, Forrest R., Andrea E. Gaughan, Catherine Linard, and Andrew J. Tatem. 2015. “Disaggregating Census Data for Population Mapping Using Random Forests with Remotely-Sensed and Ancillary Data.” PLOS ONE 10 (2): e0107042. https://doi.org/10.1371/journal.pone.0107042.\r\n\r\n\r\nWorldPop Research Group, Department of Geography and Geosciences, University of Louisville, Departement de Geographie, Universite de Namur, and Center for International Earth Science Information Network (CIESIN), Columbia University. 2018. “Global High Resolution Population Denominators Project - Funded by the Bill and Melinda Gates Foundation (OPP1134076).” https://doi.org/10.5258/SOTON/WP00645.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-02T18:00:39+01:00",
    "input_file": {}
  }
]
